{"path":"api/CsvHelper.Configuration/Configuration","templateID":1,"sharedPropsHashes":{"toc":"Z6psdd"},"localProps":{"className":"/Configuration","data":"# Configuration Class\r\n\r\nNamespace: [CsvHelper.Configuration](/api/CsvHelper.Configuration)\r\n\r\nConfiguration used for reading and writing CSV data.\r\n\r\n```cs\r\npublic class Configuration : IReaderConfiguration, IParserConfiguration, IWriterConfiguration, ISerializerConfiguration\r\n```\r\n\r\nInheritance Object -> Configuration\r\n\r\n## Constructors\r\n&nbsp; | &nbsp;\r\n- | -\r\nConfiguration() | Initializes a new instance of the ``CsvHelper.Configuration.Configuration`` class.\r\nConfiguration(CultureInfo) | Initializes a new instance of the ``CsvHelper.Configuration.Configuration`` class using the given ``System.Globalization.CultureInfo`` . Since ``CsvHelper.Configuration.Configuration.Delimiter`` uses ``CsvHelper.Configuration.Configuration.CultureInfo`` for it's default, the given ``System.Globalization.CultureInfo`` will be used instead.\r\n\r\n## Properties\r\n&nbsp; | &nbsp;\r\n- | -\r\nAllowComments | Gets or sets a value indicating if comments are allowed. True to allow commented out lines, otherwise false.\r\nBadDataFound | Gets or sets the function that is called when bad field data is found. A field has bad data if it contains a quote and the field is not quoted (escaped). You can supply your own function to do other things like logging the issue instead of throwing an exception. Arguments: context\r\nBufferSize | Gets or sets the size of the buffer used for reading CSV files. Default is 2048.\r\nComment | Gets or sets the character used to denote a line that is commented out. Default is '#'.\r\nCountBytes | Gets or sets a value indicating whether the number of bytes should be counted while parsing. Default is false. This will slow down parsing because it needs to get the byte count of every char for the given encoding. The ``CsvHelper.Configuration.Configuration.Encoding`` needs to be set correctly for this to be accurate.\r\nCultureInfo | Gets or sets the culture info used to read an write CSV files. Default is ``System.Globalization.CultureInfo.CurrentCulture`` .\r\nDelimiter | Gets or sets the delimiter used to separate fields. Default is CultureInfo.TextInfo.ListSeparator.\r\nDetectColumnCountChanges | Gets or sets a value indicating whether changes in the column count should be detected. If true, a ``CsvHelper.BadDataException`` will be thrown if a different column count is detected.\r\nDoubleQuoteString | Gets a string representation of two of the currently configured Quote characters.\r\nDynamicPropertySort | Gets or sets the comparer used to order the properties of dynamic objects when writing. The default is null, which will preserve the order the object properties were created with.\r\nEncoding | Gets or sets the encoding used when counting bytes.\r\nEscape | Gets or sets the escape character used to escape a quote inside a field. Default is '\"'.\r\nGetConstructor | Chooses the constructor to use for constuctor mapping.\r\nHasHeaderRecord | Gets or sets a value indicating if the CSV file has a header record. Default is true.\r\nHeaderValidated | Gets or sets the function that is called when a header validation check is ran. The default function will throw a ``CsvHelper.ValidationException`` if there is no header for a given member mapping. You can supply your own function to do other things like logging the issue instead of throwing an exception. Arguments: isValid, headerNames, headerNameIndex, context\r\nIgnoreBlankLines | Gets or sets a value indicating if blank lines should be ignored when reading. True to ignore, otherwise false. Default is true.\r\nIgnoreQuotes | Gets or sets a value indicating if quotes should be ignored when parsing and treated like any other character.\r\nIgnoreReferences | Gets or sets a value indicating whether references should be ignored when auto mapping. True to ignore references, otherwise false. Default is false.\r\nIncludePrivateMembers | Gets or sets a value indicating if private member should be read from and written to. True to include private member, otherwise false. Default is false.\r\nInjectionCharacters | Gets or sets the characters that are used for injection attacks.\r\nInjectionEscapeCharacter | Gets or sets the character used to escape a detected injection.\r\nLineBreakInQuotedFieldIsBadData | Gets or sets a value indicating if a line break found in a quote field should be considered bad data. True to consider a line break bad data, otherwise false. Defaults to false.\r\nMaps | The configured ``CsvHelper.Configuration.ClassMap`` s.\r\nMemberTypes | Gets or sets the member types that are used when auto mapping. MemberTypes are flags, so you can choose more than one. Default is Properties.\r\nMissingFieldFound | Gets or sets the function that is called when a missing field is found. The default function will throw a ``CsvHelper.MissingFieldException`` . You can supply your own function to do other things like logging the issue instead of throwing an exception. Arguments: headerNames, index, context\r\nPrepareHeaderForMatch | Prepares the header field for matching against a member name. The header field and the member name are both ran through this function. You should do things like trimming, removing whitespace, removing underscores, and making casing changes to ignore case.\r\nQuote | Gets or sets the character used to quote fields. Default is '\"'.\r\nQuoteString | Gets a string representation of the currently configured Quote character.\r\nReadingExceptionOccurred | Gets or sets the function that is called when a reading exception occurs. The default function will re-throw the given exception. If you want to ignore reading exceptions, you can supply your own function to do other things like logging the issue. Arguments: exception\r\nReferenceHeaderPrefix | Gets or sets a callback that will return the prefix for a reference header. Arguments: memberType, memberName\r\nSanitizeForInjection | Gets or sets a value indicating if fields should be sanitized to prevent malicious injection. This covers MS Excel, Google Sheets and Open Office Calc.\r\nShouldQuote | Gets or sets a function that is used to determine if a field should get quoted when writing. Arguments: field, context\r\nShouldSkipRecord | Gets or sets the callback that will be called to determine whether to skip the given record or not.\r\nShouldUseConstructorParameters | Determines if constructor parameters should be used to create the class instead of the default constructor and members.\r\nTrimOptions | Gets or sets the field trimming options.\r\nTypeConverterCache | Gets or sets the ``CsvHelper.Configuration.Configuration.TypeConverterOptionsCache`` .\r\nTypeConverterOptionsCache | Gets or sets the ``CsvHelper.Configuration.Configuration.TypeConverterOptionsCache`` .\r\nUseNewObjectForNullReferenceMembers | Gets or sets a value indicating that during writing if a new object should be created when a reference member is null. True to create a new object and use it's defaults for the fields, or false to leave the fields empty for all the reference member's member.\r\n\r\n## Methods\r\n&nbsp; | &nbsp;\r\n- | -\r\nAutoMap&lt;T&gt;() | Generates a ``CsvHelper.Configuration.ClassMap`` for the type.\r\nAutoMap(Type) | Generates a ``CsvHelper.Configuration.ClassMap`` for the type.\r\nRegisterClassMap&lt;TMap&gt;() | Use a ``CsvHelper.Configuration.ClassMap<TClass>`` to configure mappings. When using a class map, no members are mapped by default. Only member specified in the mapping are used.\r\nRegisterClassMap(Type) | Use a ``CsvHelper.Configuration.ClassMap<TClass>`` to configure mappings. When using a class map, no members are mapped by default. Only members specified in the mapping are used.\r\nRegisterClassMap(ClassMap) | Registers the class map.\r\nUnregisterClassMap&lt;TMap&gt;() | Unregisters the class map.\r\nUnregisterClassMap(Type) | Unregisters the class map.\r\nUnregisterClassMap() | Unregisters all class maps.\r\n"}}
