{"path":"api/CsvHelper.Configuration/MemberMapData","templateID":1,"sharedPropsHashes":{"toc":"Z6psdd"},"localProps":{"className":"/MemberMapData","data":"# MemberMapData Class\r\n\r\nNamespace: [CsvHelper.Configuration](/api/CsvHelper.Configuration)\r\n\r\nThe configured data for the member map.\r\n\r\n```cs\r\npublic class MemberMapData \r\n```\r\n\r\nInheritance Object -> MemberMapData\r\n\r\n## Constructors\r\n&nbsp; | &nbsp;\r\n- | -\r\nMemberMapData(MemberInfo) | Initializes a new instance of the ``CsvHelper.Configuration.MemberMapData`` class.\r\n\r\n## Properties\r\n&nbsp; | &nbsp;\r\n- | -\r\nConstant | Gets or sets the constant value used for every record.\r\nDefault | Gets or sets the default value used when a CSV field is empty.\r\nIgnore | Gets or sets a value indicating whether the field should be ignored.\r\nIndex | Gets or sets the column index.\r\nIndexEnd | Gets or sets the index end. The Index end is used to specify a range for use with a collection member. Index is used as the start of the range, and IndexEnd is the end of the range.\r\nIsConstantSet | Gets or sets a value indicating if a constant was explicitly set.\r\nIsDefaultSet | Gets or sets a value indicating whether this instance is default value set. the default value was explicitly set. True if it was explicitly set, otherwise false.\r\nIsIndexSet | Gets or sets a value indicating if the index was explicitly set. True if it was explicitly set, otherwise false.\r\nIsNameSet | Gets or sets a value indicating if the name was explicitly set. True if it was explicity set, otherwise false.\r\nIsOptional | Gets or sets a value indicating if a field is optional.\r\nMember | Gets the ``System.Reflection.MemberInfo`` that the data is associated with.\r\nNameIndex | Gets or sets the index of the name. This is used if there are multiple columns with the same names.\r\nNames | Gets the list of column names.\r\nReadingConvertExpression | Gets or sets the expression used to convert data in the row to the member.\r\nTypeConverter | Gets or sets the type converter.\r\nTypeConverterOptions | Gets or sets the type converter options.\r\nValidateExpression | Gets or sets the expression use to validate a field.\r\nWritingConvertExpression | Gets or sets the expression to be used to convert the object to a field.\r\n"}}
