{"path":"/","templateID":0,"sharedPropsHashes":{},"localProps":{"className":"home","data":"# CsvHelper\r\n\r\n**Note:** Documentation will be update daily until it's complete. I didn't want the release of 3.0.0 to be pushed back any more due to documentation.\r\n\r\nA library for reading and writing CSV files. Extremely fast, flexible, and easy to use. Supports reading and writing of custom class objects. CSV helper implements [RFC 4180](https://tools.ietf.org/html/rfc4180). By default, it's very conservative in its writing, but very liberal in its reading. There is a large set of configuration that can be done to change how reading and writing behaves, giving you the ability read/write non-standard files also.\r\n\r\n## Installation\r\n\r\n### Package Manager Console\r\n\r\n```\r\nPM> Install-Package CsvHelper\r\n```\r\n\r\n### .NET CLI Console\r\n\r\n```\r\n> dotnet add package CsvHelper\r\n```\r\n\r\n## Documentation\r\n\r\n[http://joshclose.github.io/CsvHelper](http://joshclose.github.io/CsvHelper)\r\n\r\n## License\r\n\r\nDual licensed. Choose whichever license suits your needs.\r\n\r\n[Microsoft Public License (MS-PL)](http://www.opensource.org/licenses/MS-PL)\r\n\r\n[Apache License, Version 2.0](http://opensource.org/licenses/Apache-2.0)\r\n\r\n## Contributions\r\n\r\nWant to contribute? Great! Here are a few guidelines.\r\n1. If you want to do a feature, post an issue about the feature first. Some features are intentionally left out, some features may already be in the works, or I may have some advice on how I think it should be done. I would feel bad if time was spent on some code that won't be used.\r\n2. If you want to do a bug fix, it might not be a bad idea to post about it too. I've had the same bug fixed by multiple people at the same time before.\r\n3. All code should have a unit test. If you make a feature, there should be significant tests around the feature. If you do a bug fix, there should be a test specific to that bug so it doesn't happen again.\r\n4. Pull requests should have a single commit. If you have multiple commits, squash them into a single commit before requesting a pull.\r\n5. Try and follow the code styling already in place.\r\n\r\nLooking for 2.x documentation? You can find it [here](./2.x).\r\n\r\n<br/>"}}
